/*
 *   변수 ==> 데이터형, 식별자 (암기)
 *       ==> 한개의 데이터를 저장하는 메모리공간
 *       (저장된 영역으 변경해서 다시 저장이 가능)
 *       => 변수 기능 (읽기(값을 가지고 옴),쓰기(메모리에 저장, 수정)
 *       => 변수를 저장하기 위해서는 먼저 메모리 크기를 결정
 *          ------------------------------------------
 *                   |
 *               기본형(데이터형)
 *               참조형(사용자 정의) : 배열, 클래스
 *   
 *   변수 활용 (프로그램 => 데이터 관리)
 *   변수 활용 방법 => 연산자, 제어문
 *   연산자
 *    = 단항연산자 (++,--,!,(데이터형))
 *    = 이항연산자
 *        = +,-,*,/,%
 *        = ==,!=, <=, >=, >,<
 *        = &&, ||
 *        = =, +=, -=
 *    = 삼항연산자
 *     = ? :
 *    => 자동 형변환, 강제 형변환
 *    => +는 문자열 결합
 *    --------------------------------
 *    프로그램 흐름 제어
 *     => 오류 발생시 건너뛴다 => if
 *     => 반복수행 : for, while
 *     => 원하는 프로그램 수행 : if,switch
 *     => 제어문
 *        = 조건문
 *          => 단일조건문
 *             if(조건문) { => 조건문은 반드시 비교연산자, 부정연산자, 논리연산
 *             }
 *          => 선택조건문 if~else
 *          => 다중조건문 if~else if~(else)
 *        = 선택문
 *        switch(정수, 문자, 문자열)
 *        {
 *        case 값1:
 *          처리문장
 *          break;
 *        case 값2:
 *          처리문장
 *          break;
 *        case 값3:
 *          처리문장
 *          break;
 *        default:
 *          
 *        }
 *        
 *        = 반복문
 *   변수
 *      state={
 *         name
 *         sex..
 *      }
 *      data:{
 *         name
 *         sex..
 *      }   
 *                
 *               
 */
public class 제어문_반복문_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
