/*
 *  2page 
 *  자바언어의 특징
 *  -----------
 *  1)실행방법
 *    = 컴파일 방식 ==> 2진파일로 변경 ( 컴퓨터가 인식하는 언어)
 *                   c/c++,,,java
 *                   기계어
 *            ****자바의 특징
 *                컴파일
 *                 c/c++ => 컴파일시 운영체제마다 다른 컴파일을 한다
 *                       => 컴파일된 내용이 다르다
 *                 java  => 운영체제마다 동일
 *                 => 컴파일된 파일 : 바이너리코드
 *                                 ------------
 *                                 One write       
 *   
 *    = 인터프리터 방식  ==> 한줄씩 번역해서 실행
 *              HTML / CSS
 *    = 보안 => 두번을 검색하기 때문에 (소스 검증)
 *      => 보안이 뛰어나다 => 인증시스템
 *               
 *                자바소스
 *                  ㅣ
 *                  JVM => 파일(dll)
 *                  ㅣ
 *          ------------------------
 *          ㅣ        ㅣ         ㅣ
 *          리눅스   원도우       mac
 *          =실행과정
 *                      기계어로 변경(javac)          한줄씪 번역(java)
 *          a.java ====================== A.class ================> Hello java!!
 *          프로그래머 코딩       컴파일       바이너리코드      인터프리터
 *          
 *               => 편집기 : 이클립스. 인텔리j (파이참)
 *               --------------------------- 어시스트
 *               이클립스 = java+javac => ctrl+f11
 *          --------------------------------------
 *          다운로드 : eclipssljp.org =>J2ee
 *          6page : 개발환ㄱ여 구축
 *          jdk = > 17 (이상버전은 한글 제어에 문제)
 *          ---> 스프링 (14)
 *               스프링 (sts =>3 .   
 *          
 *          
 *          
 *          
 *          => 화면 출력 => ctrl + space
 */ 
public class 자바언어_실행방법 {
	/*
	 * rtrtrtetert rttttttt tttttttttttttt
	 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub
        System.out.println("hello java");
	}

}
