/*
 *  프로그램
 *  1. 데이터 저장
 *     변수 / 상수
 *     변하는 수(변경가능) / 변하지 않는 수
 *     =>저장해야되는 데이터가 많을 경우
 *     => 묶어서 저장 (배열/클래스) (사용자 정의)
 *     ----------------------------- 메모리에 저장
 *                                     -------- RAM
 *     => 사라지지 않는 저장값 : 파일 /데이터베이스(오라클)
 *     ------------------------------------------
 *     
 *  2. 데이터 가공 (사용자요청)
 *     연산자  ,  제어문
 *     --------------- 메소드 
 *     함수(c/c++) / 메소드(c#.자바) (****기술면접)
 *     ---------------
 *     -> 클래스 종속
 *     
 *     
 *  3. 가공된 데이터 출력
 *  =  application (window,dos) => main
 *  = web application (브라우저) => main(x)
 *  
 *  4. 자바 : 데이터관리. 브라우저 전송, 오라클 연동
 *  5. 라이브러리
 *     java.util. java.io. java.net => 기타
 *     mvnrepository.com
 *     ------------------
 *  6. 조립법
 *  --------------------------------------
 *  7. 알고리즘, 디자인패턴 =>코테
 *  --------------------------------- 관련된 내용을 묶어서 관리
 */
public class MainClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
