/*
 *  면접
 *  ----
 *  함수 vs 메소드의 차이
 *  ----------------- 한가지 기능을 수행
 *  함수 : 독립적으로 사용 (c언어)
 *  메소드 : 클래스 종속 (java,클래스 안에 메소드)
 *  ------------------------------------메소드는 종료하는 시점이 있음 ==> 메소드는 return 가지고 있음(생략하면 자동으로 컴파일) =>void일때만
 *  배열/메소드
 *  --------클래스
 *          -----객체지향에 맞게 변경
 *               데이터 보호 (캡슐화)
 *               재사용 (상속, 포함)
 *                     is-a, has-a
 *               수정, 추가
 *               오버라이딩(modify), 오버로딩(new)
 *               ====> 유지보수가 쉽게 제작
 */
public class 제어문_반복제어문5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		return; //자바 컴파일러가 자동으로 추가
	}

}
